{
  "common": {
    "format": "Format",
    "validate": "Validate",
    "edit": "Edit",
    "convert": "Convert",
    "readMore": "Read More",
    "tryTool": "Try Tool",
    "readTime": "min read",
    "tutorial": "Tutorial",
    "tableOfContents": "Table of Contents"
  },
  "home": {
    "title": "JSON Tools",
    "subtitle": "Simple, Fast, and Efficient JSON Processing Tools",
    "description": "Provides formatting, validation, editing, conversion, and more JSON processing features to make your development work easier.",
    "tryNow": "Try Now"
  },
  "formatter": {
    "title": "JSON Formatter",
    "description": "Beautify and format JSON data for better readability"
  },
  "validator": {
    "title": "JSON Validator",
    "description": "Validate JSON data and quickly find syntax errors"
  },
  "editor": {
    "title": "JSON Editor",
    "description": "Edit and modify JSON data online with real-time preview"
  },
  "converter": {
    "title": "JSON Converter",
    "description": "Convert between different data formats"
  },
  "xml": {
    "title": "XML Converter",
    "description": "Convert between XML and JSON formats with ease",
    "xmlInput": "XML Input",
    "jsonInput": "JSON Input",
    "xmlOutput": "XML Output",
    "jsonOutput": "JSON Output",
    "convert": "Convert",
    "switchMode": "Switch Mode",
    "xmlToJson": "XML → JSON",
    "jsonToXml": "JSON → XML",
    "invalidXml": "Invalid XML format",
    "invalidJson": "Invalid JSON format"
  },
  "blog": {
    "title": "Technical Blog",
    "subtitle": "Explore best practices and technical guides for data format conversion",
    "xmlToJson": {
      "title": "XML to JSON Conversion Guide",
      "description": "Learn how to convert between XML and JSON formats with detailed examples, best practices, and a free online converter tool."
    },
    "jsonToYaml": {
      "title": "JSON and YAML Conversion Guide",
      "description": "Master the complete guide to converting between JSON and YAML formats, including practical examples and best practices."
    },
    "jsoncGuide": {
      "title": "How to Handle JSON with Comments (JSONC)",
      "description": "Learn how to handle JSON with comments, including parsing methods and common issues."
    },
    "jsonEscapeGuide": {
      "title": "Complete Guide to JSON Escaping and Unescaping",
      "description": "Understand JSON escaping and unescaping, common characters, and handling in different languages."
    },
    "jsonCompressionGuide": {
      "title": "Best Practices for JSON Compression and Beautification",
      "description": "Explore the importance of JSON compression and beautification, tools, and implementation methods."
    },
    "jsonStringConversion": {
      "title": "How to Convert JSON from String: A Comprehensive Guide",
      "description": "Learn how to convert JSON strings into usable objects in JavaScript, Python, and Java. A step-by-step guide with examples, error handling tips, and best practices for beginners and experts."
    },
    "jsonHttpExtract": {
      "title": "How to Perform HTTP Extract from JSON: A Step-by-Step Guide",
      "description": "Learn how to perform HTTP extract from JSON with step-by-step examples in Python, JavaScript, and Java. Extract data from APIs efficiently and securely."
    }
  }
} 